[
    {
        "text": "Job descriptions these days:\nEntry-level position.\nRequires 10 years of experience in a tool that came out last year.\nSalary: 'Competitive' (read: peanuts).\nPerks: 'Pizza Fridays' (but you're working late anyway).\nThe future is bright, just not for us!",
        "engagement": 150,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Job Description",
            "Career Humor"
        ]
    },
    {
        "text": "For freshers joining Infosys, the CTC typically varies based on the role and skills. General entry-level roles offer a package in the range of ₹3.6 to ₹4 lakh per annum.\n\nFor specialized positions in niche areas such as data mining or cybersecurity, the packages can go up to ₹9 lakh per annum.\n\nInfosys salary hikes:\n\nFY22: 14.6%\nFY23: 9.9%\nFY24: 9%\n\nInflation rate (India):\n\nFY22: ~5.5%\nFY23: ~6.7%\nFY24: ~5.6%\n\nAnnual cost of living increase in major Indian cities:\n\n2022–2024: Average increase ~10% per year.\n\nWhy compare with Modi?\n\nThere are lots of construction workers who are paid on hourly/daily basis because they need that money. They easily put in 100 hours.\n\nPM may already have lots of money.\n\nIf you want to compare, compare with the middle class people.\n\nRecently I saw someone saying that all people get gaaliya, even celebrities do.\n\nHow can you compare a problem like this with elite people?\n\nEven if celebrities, cricketers etc get gaaliya, they earn a lot more than us.\n\nA middle class person can work for 6 days * 14 hours but the question is -\n\nWill you pay us fairly?",
        "engagement": 1518,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Salary",
            "Company"
        ]
    },
    {
        "text": "People be like: 'Meditate, it will fix everything.'\nMeanwhile, Indian relatives: 'Beta, just work harder, that’s the best therapy.' 😂\nMental health is becoming a real conversation, but we’ve still got a long way to go!\n\nWhat’s the most 'Indian' mental health advice you’ve received?\nMine was -\n\n'So jao, sabb sahi ho jaayega!'\n\n'Depression ke baare mein soch soch ke depression ho raha hai tumko!'\n\n'Yeh Therapist ne tumhara dimag kharab kar diya hai'",
        "engagement": 143,
        "line_count": 7,
        "language": "Hinglish",
        "tags": [
            "Mental Health",
            "Family"
        ]
    },
    {
        "text": "🚨 Beware of the 'Pay After Placement' Trap 🚨\n\nIndian edtech companies are promoting 'Pay after placement' schemes. Sounds great, right? But here’s the reality:\n\n🔹 Some companies still charge you hidden fees or high-interest rates\n\n🔹 The placement process can be drawn out, or you might be pushed into jobs that aren’t a good fit\n\nIt’s a system full of red flags, and many students end up feeling cheated.\n\nEducation shouldn’t be a gamble.\n\nLet’s call out these practices and demand transparency.\n\n💬 Have you or someone you know fallen into this trap? Let’s spread awareness.",
        "engagement": 200,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Education"
        ]
    },
    {
        "text": "Interviewer-\nCan you explain the gap in your CV?\n\nMe-\nI am sorry but I made it in Google Docs and you opened it in Microsoft Word.\n\nInterviewer-\nOh ok.",
        "engagement": 160,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Interview",
            "Resume"
        ]
    },
    {
        "text": "You want more followers?\nMore likes?\nMore engagement?\nMore comments?\n\nJust play with the feelings of others on this platform.\n\nPost fake jobs every day, post useless links with them and people will come from far away commenting 'Interested.'\n\nAs a job seeker, it feels like a mockery to a tedious job-hunting process.\n\nPersonally, I don't know how people are ok with this, are they not afraid of Karma or repercussions?\n\nAs a person who makes posts with hard work and creative ideas, it makes me wonder if no one really enjoys useful content nowadays.\n\nIt's just sad to see this.\nActivate to view larger image.",
        "engagement": 71,
        "line_count": 13,
        "language": "English",
        "tags": [
            "Job Search",
            "Social Media"
        ]
    },
    {
        "text": "What Recession?\nWhat Layoffs?\n\nEveryone hiring Data Analyst @Remote with a 40% hike.\nStart in 15 days.\nFor freshers :)\n\nAnd the best part, link deviates you to a website registration page, nothing else (not the actual job) because of course it doesn't exist.\n\nJust write hiring Data Analyst @remote, you'll see the same copied posts just to scam you again.\n\nSee the engagement on these posts, number of likes, comments, etc., and here we are writing real posts to help you out but ok ;(\n\nThe worst part-\n\nIt's like taking advantage of people who are deliberately looking for jobs.\n\nSetting unrealistic expectations.\n\nNo one deserves this.\n\nThank you everyone!\n\nRecession is in your mind because LinkedIn is full of jobs 😉\n\nEdit-\nI am not against Cuvette but if you see the link in the posts it is the registration link for Cuvette and doesn't point to the job posting link.",
        "engagement": 882,
        "line_count": 17,
        "language": "English",
        "tags": [
            "Economy",
            "Scams"
        ]
    },
    {
        "text": "Anyone is providing mentorship nowadays.\n\nCharging 1000s and scamming.\n\nNo experience.\nJust a fancy company.\n\nPlease do your research before choosing the right mentor.\n\nIt has become a business.\nRead reviews, make sound decisions.\n\n16 year olds have made accounts on these platforms.\nNo Real Experience.\nOnly a fancy job title/company.",
        "engagement": 238,
        "line_count": 9,
        "language": "English",
        "tags": [
            "Mentorship",
            "Scams"
        ]
    },
    {
        "text": "Just saw a LinkedIn Influencer with 'Organic Growth' written in the profile with 65K+ followers claiming that he can help you in growing your platform, copying the posts from other influencers.",
        "engagement": 97,
        "line_count": 1,
        "language": "English",
        "tags": [
            "Growth",
            "Influencer"
        ]
    },
    {
        "text": "Jobseekers, this one’s for you.\n\nEvery application, every interview, every follow-up… the pressure is immense.\n\nAnd I know what you're thinking: Am I not good enough?\n\nBut let me tell you, this isn’t about you or your skills. It’s about a broken system where 60% of applicants never hear back.\n\nYour mental health is not worth sacrificing for a system that doesn’t acknowledge your worth.\n\nPlease remember, taking care of yourself is the real priority.\n\nYour dream job will come, but for now, breathe. 🌻",
        "engagement": 335,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Mental Health",
            "Job Search"
        ]
    },
    {
        "text": "LinkedIn scams be like: 'Congratulations, you've been selected for a role you didn’t even apply for!'\n\nThe catch? Pay Rs. 50,000 for the honor.",
        "engagement": 115,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "Scams"
        ]
    },
    {
        "text": "To all the jobseekers-\n\nI know the market is tough.\nI also had a difficult time looking for a new role.\n\nJust don't give up.\nNot everything is your fault.\n\nYou can just try your best.\nGive it all in.\n\nBe brave.\nFace the hardship.\nHold on for a while.\n\nI know the time is rough but in the end it'll be all worth it.\n\nYou are enough.\nDon't stop doubting your skills and preparation.\n\nTime is tough and so are you.",
        "engagement": 705,
        "line_count": 12,
        "language": "English",
        "tags": [
            "Job Search",
            "Motivation"
        ]
    }
]